GeFengthe/RTL8762/board/evb/fireswitch/app/skylight.c


#include <stddef.h>    // standard definitions
#include <stdint.h>    // standard integer definition
#include <math.h>
#include "rtl876x.h"
#include "rtl876x_rcc.h"
#include "rtl876x_tim.h"
#include "rtl876x_pinmux.h"
#include "rtl876x_gpio.h"
#include "platform_os.h"

#include "trace.h"
#include "skylight.h"
#include "app_skyiot_dlps.h"


plt_timer_t LEDCtrl_timer = NULL;
static uint16_t m_step_cnt = 0;

// #define APP_DBG_PRINTF(fmt, ...)
#define APP_DBG_PRINTF   DBG_DIRECT

#if 1
#define FRONT_LED_PWM		0
#define REAR_LED_PWM		1
#define TOTALPWMNUMBER     	2

#define PIN_INVALID       0xff
typedef struct
{
    uint8_t pin_num;
    uint8_t pin_func;
    TIM_TypeDef *tim_id;
    uint16_t duty_cycle;
} light_t;

static light_t light_pwm[TOTALPWMNUMBER] =
{
    {LED_FRONT, timer_pwm3, TIM3, PWM_DUTY_INIT},
    {LED_REAR, timer_pwm2, TIM2, PWM_DUTY_INIT},
};

static SkyLightManager *mLightManager=NULL;


/*
** PWM
*/
static void Pwm_Pin_Tmr_Config(const light_t *light)
{
    if (PIN_INVALID == light->pin_num)
    {
        return ;
    }

    Pad_Config(light->pin_num, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE,
               PAD_OUT_LOW);
    Pinmux_Config(light->pin_num, light->pin_func);
    /* TIM */
    TIM_TimeBaseInitTypeDef TIM_InitStruct;
    TIM_StructInit(&TIM_InitStruct);
    TIM_InitStruct.TIM_PWM_En = PWM_ENABLE;
    /*<! PWM output freqency = 20M/(TIM_PWM_High_Count + TIM_PWM_Low_Count) */
    /*<! PWM duty cycle = TIM_PWM_High_Count/(TIM_PWM_High_Count + TIM_PWM_Low_Count) */
    
    if(light->pin_num == LED_FRONT){
        switch((uint8_t)mLightManager->light_newmode)
        {
            case RELEASE_MODE:
            case REACT_MODE_M:
            case REACT_MODE_S:
            case REACT_MODE_A:
            case UNREACT_MODE_N:
            case UNREACT_MODE_S:
                TIM_InitStruct.TIM_PWM_High_Count = PWM_DUTY_INIT;
                TIM_InitStruct.TIM_PWM_Low_Count  = PWM_FREQUENCY;
                break;
            case UNREACT_MODE_M:
            case UNREACT_MODE_A:
                TIM_InitStruct.TIM_PWM_High_Count = PWM_FREQUENCY;
                TIM_InitStruct.TIM_PWM_Low_Count  = PWM_DUTY_INIT;
                break;
        }
    }else if(light->pin_num == LED_REAR){
        switch((uint8_t)mLightManager->light_newmode)
        {
            case RELEASE_MODE:
            case REACT_MODE_M:
            case REACT_MODE_S:
            case REACT_MODE_A:
            case UNREACT_MODE_N:
            case UNREACT_MODE_M:
                TIM_InitStruct.TIM_PWM_High_Count = PWM_DUTY_INIT;
                TIM_InitStruct.TIM_PWM_Low_Count  = PWM_FREQUENCY;
                break;
            case UNREACT_MODE_S:
            case UNREACT_MODE_A:
                TIM_InitStruct.TIM_PWM_High_Count = PWM_FREQUENCY;
                TIM_InitStruct.TIM_PWM_Low_Count  = PWM_DUTY_INIT;
                break;
        }
    }
    
	

    TIM_InitStruct.TIM_Mode = TIM_Mode_UserDefine;
    TIM_InitStruct.TIM_SOURCE_DIV = TIM_CLOCK_DIVIDER_2;
    TIM_TimeBaseInit(light->tim_id, &TIM_InitStruct);
    /* Enable PWM output */
    if((light->pin_num == LED_FRONT && (mLightManager->light_newmode == UNREACT_MODE_M || mLightManager->light_newmode == UNREACT_MODE_A)) ||
       (light->pin_num == LED_REAR && (mLightManager->light_newmode == UNREACT_MODE_S || mLightManager->light_newmode == UNREACT_MODE_A))){
            TIM_Cmd(light->tim_id, ENABLE);
       }
    
}

static void pwm_disable(const light_t *light)
{
    if (PIN_INVALID == light->pin_num)
    {
        return ;
    }
	
    /* DISENABLE PWM output */
    TIM_Cmd(light->tim_id, DISABLE);
}


static void pwm_enable(const light_t *light)
{
    if (PIN_INVALID == light->pin_num)
    {
        return ;
    }
	
    /* DISENABLE PWM output */
    TIM_Cmd(light->tim_id, ENABLE);
}

static void pwm_duty_cycle(const light_t *light)
{
    if (PIN_INVALID == light->pin_num)
    {
        return ;
    }
	
    TIM_PWMChangeFreqAndDuty(light->tim_id, light->duty_cycle, PWM_FREQUENCY-light->duty_cycle); 
}

void HAL_PwmForLight_Init(void)
{
    /* turn on timer clock */
    RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
    *((volatile uint32_t *)0x40000360UL) &= ~(1 << 10);

	#ifdef FRONT_LED_PWM
	Pwm_Pin_Tmr_Config(&light_pwm[FRONT_LED_PWM]);  // 配置io为PWM
	#endif

	#ifdef REAR_LED_PWM
	Pwm_Pin_Tmr_Config(&light_pwm[REAR_LED_PWM]); 
	#endif
}

void HAL_PwmForLight_Deinit(void)
{
#ifdef FRONT_LED_PWM
    pwm_disable(&light_pwm[FRONT_LED_PWM]);
#endif
#ifdef REAR_LED_PWM
    pwm_disable(&light_pwm[REAR_LED_PWM]);
#endif
}

static int8_t HAL_UpdatePwmDuty(uint16_t front_w,uint16_t rear_w)
{
#ifdef FRONT_LED_PWM
	if(front_w > 0){
		light_pwm[FRONT_LED_PWM].duty_cycle = front_w;
		pwm_duty_cycle(&light_pwm[FRONT_LED_PWM]);
	}
#endif
#ifdef REAR_LED_PWM
	if(rear_w > 0){
		light_pwm[REAR_LED_PWM].duty_cycle = rear_w;
		pwm_duty_cycle(&light_pwm[REAR_LED_PWM]);
	}
#endif
	return 0;
}


void HAL_Lighting_Nightlight(uint8_t front_w, uint8_t rear_w)
{   
	if(front_w > 100 || rear_w > 100){
		return;
	}
	
	if(front_w == 0 && rear_w == 0){
		HAL_PwmForLight_Deinit();
		return;
	}
	
	if(front_w == 0){
		pwm_disable(&light_pwm[FRONT_LED_PWM]);
	}else{
        pwm_enable(&light_pwm[FRONT_LED_PWM]);
    }
	
	if(rear_w == 0){
		pwm_disable(&light_pwm[REAR_LED_PWM]);
	}else{
        pwm_enable(&light_pwm[REAR_LED_PWM]);
    }
	
	HAL_UpdatePwmDuty(front_w*PWM_FREQUENCY/100, rear_w*PWM_FREQUENCY/100);
}

void HAL_Lighting_OFF(void)
{
	HAL_Lighting_Nightlight(0, 0);
}

void HAL_Lighting_ON(void)
{	
	if(mLightManager==NULL){
		APP_DBG_PRINTF("%s mLightManager=NULL !!!\r\n",__func__);	
		return;
	}
	
	HAL_Lighting_Nightlight(100, 100);
}

void HAL_Lighting_Default(void)
{	
	if(mLightManager==NULL){
		APP_DBG_PRINTF("%s mLightManager=NULL !!!\r\n",__func__);	
		return;
	}
	
#if USE_LIGHT_FOR_SKYIOT
	#if ((SKY_LIGHT_TYPE==SKY_LIGHT_BELT_TYPE)||(SKY_LIGHT_TYPE==SKY_LIGHT_BULB_TYPE))
	mLightManager->ctp = DEFAULT_SUNLIGHT_CTP_VALUE;
	mLightManager->bri = DEFAULT_LIGHT_BRI_VALUE;
	HAL_Lighting_Sunlight( mLightManager->ctp, mLightManager->bri );
	
	#elif (SKY_LIGHT_TYPE==SKY_LIGHT_BULB_RGBWY_TYPE)
	if(mLightManager->ctp){
		mLightManager->ctp = DEFAULT_SUNLIGHT_CTP_VALUE;
		mLightManager->bri = DEFAULT_LIGHT_BRI_VALUE;
		HAL_Lighting_Sunlight( mLightManager->ctp, mLightManager->bri );
	}else{
		mLightManager->bri = DEFAULT_LIGHT_BRI_VALUE;
		mLightManager->hue = DEFAULT_LIGHT_HUE_VALUE;
		mLightManager->sat = DEFAULT_LIGHT_SAT_VALUE;
		 HAL_Lighting_Color( mLightManager->hue, mLightManager->sat, mLightManager->bri );	  
	}
	
	#endif
#endif

	   
