GeFengthe/RTL8762/board/evb/fireswitch/app/skylight.c
}


bool HAL_Lighting_Init(SkyLightManager *manager)
{
	if( manager == NULL){
		return false;
	}
		
	mLightManager = manager;
	HAL_PwmForLight_Init();
	if(mLightManager->light_newmode == UNREACT_MODE_M){
		mLightManager->front_led |= LED1_FLAG_STATUS_N;
	}else if(mLightManager->light_newmode == UNREACT_MODE_S){
		mLightManager->rear_led |= LED2_FLAG_STATUS_N;
	}else if(mLightManager->light_newmode == UNREACT_MODE_A){
		mLightManager->front_led |= LED1_FLAG_STATUS_N;
		mLightManager->rear_led |= LED2_FLAG_STATUS_N;
	}

	return true;	
}

void HAL_Light_Dlps_Control(bool isenter)
{
	if(isenter){
		switch((uint8_t)mLightManager->light_newmode)
		{
			case RELEASE_MODE:
			case REACT_MODE_M:
			case REACT_MODE_S:
			case REACT_MODE_A:
			case UNREACT_MODE_N:
				Pad_Config(LED_FRONT, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
				Pad_Config(LED_REAR, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
				break;
			
			case UNREACT_MODE_M:
				Pad_Config(LED_FRONT, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_HIGH);
				Pad_Config(LED_REAR, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
				break;
			
			case UNREACT_MODE_S:
				Pad_Config(LED_FRONT, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
				Pad_Config(LED_REAR, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_HIGH);
				break;
			
			case UNREACT_MODE_A:
				Pad_Config(LED_FRONT, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_HIGH);
				Pad_Config(LED_REAR, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_HIGH);
				break;
		}
	}else{
        HAL_PwmForLight_Init();
	}
}

static void SkyLed_Timeout_cb(void *timer)
{
	switch((uint8_t)mLightManager->led_mode)
	{
		case FAST_BLINK:
			if(mLightManager->led_timercnt > 0){
				if(m_step_cnt%10 == 1){
					if(mLightManager->led_timercnt%2 == 1){
						HAL_UpdatePwmDuty(0, PWM_FREQUENCY);
					}else{
						HAL_UpdatePwmDuty(0, 1);
					}
					mLightManager->led_timercnt--;
				}
			}else{
				m_step_cnt = 0;
                if(mLightManager->light_newmode == UNREACT_MODE_N ||
                   mLightManager->light_newmode == UNREACT_MODE_M ||
                   mLightManager->light_newmode == UNREACT_MODE_S ||
                   mLightManager->light_newmode == UNREACT_MODE_A){
                    control_mode_switch(true);
                }
				mLightManager->led_mode = UNKOWN;
				Led_Relay_tmr_ctrl_dlps(true);
				plt_timer_delete(LEDCtrl_timer, 0);
			}
			break;
			
		case SLOW_BLINK:
			if(mLightManager->led_timercnt > 0){
				if(m_step_cnt%25 == 1){
					if(mLightManager->led_timercnt%2 == 1){
						HAL_UpdatePwmDuty(0, PWM_FREQUENCY);
					}else{
						HAL_UpdatePwmDuty(0, 1);
					}
					mLightManager->led_timercnt--;
				}
			}else{
				m_step_cnt = 0;
				mLightManager->led_mode = UNKOWN;
				Led_Relay_tmr_ctrl_dlps(true);
				plt_timer_delete(LEDCtrl_timer, 0);
			}
			break;
			
		case MODE_BLINK:
			if(mLightManager->led_timercnt > 0){
				if(m_step_cnt%10 == 1){
//                    APP_DBG_PRINTF("mLightManager->led_timercnt:%d\r\n", mLightManager->led_timercnt);
                    if(mLightManager->led_timercnt%2 == 1){
                        switch((uint8_t)mLightManager->light_newmode)
                        {
                            case REACT_MODE_M:
                            case UNREACT_MODE_M:
                                HAL_UpdatePwmDuty(PWM_FREQUENCY, 0);
                                break;
                            
                            case REACT_MODE_S:
                            case UNREACT_MODE_S:
                                HAL_UpdatePwmDuty(0, PWM_FREQUENCY);
                                break;
                            
                            case REACT_MODE_A:
                            case UNREACT_MODE_A:
                                HAL_UpdatePwmDuty(PWM_FREQUENCY, PWM_FREQUENCY);
                                break;
                            default:
                                break;
                        }
                    }else{
                        HAL_UpdatePwmDuty(1, 1);
                    }
					mLightManager->led_timercnt--;
				}
			}else{
				m_step_cnt = 0;

				if((mLightManager->light_newmode == UNREACT_MODE_N\
                   || mLightManager->light_newmode == UNREACT_MODE_M\
                   || mLightManager->light_newmode == UNREACT_MODE_S\
                   || mLightManager->light_newmode == UNREACT_MODE_A)){		    // 常亮模式，直接控制
                    mLightManager->led_mode = UNKOWN;
                    Led_Relay_tmr_ctrl_dlps(true);
                    plt_timer_delete(LEDCtrl_timer, 0);
                    
				}else if((mLightManager->light_newmode == REACT_MODE_M\
                       || mLightManager->light_newmode == REACT_MODE_S\
                       || mLightManager->light_newmode == REACT_MODE_A)){	    // 感应模式，led_timercnt为亮灯时长（time*50）
					mLightManager->led_mode = SHORT_BRIGHT;
					mLightManager->led_timercnt = 50*5;
//                    APP_DBG_PRINTF("mLightManager->led_timercnt:%d\r\n", mLightManager->led_timercnt);
				}
			}
			break;
		
		case SHORT_BRIGHT:
			if(mLightManager->led_timercnt > 0){
                mLightManager->led_timercnt--;
            }else{
                m_step_cnt = 0;
                pwm_disable(&light_pwm[FRONT_LED_PWM]);
                pwm_disable(&light_pwm[REAR_LED_PWM]);
				mLightManager->led_mode = UNKOWN;
				Led_Relay_tmr_ctrl_dlps(true);
				plt_timer_delete(LEDCtrl_timer, 0);
            }
			break;
		
		case LONG_BRIGHT:
            m_step_cnt = 0;
            mLightManager->led_mode = UNKOWN;
            Led_Relay_tmr_ctrl_dlps(true);
            plt_timer_delete(LEDCtrl_timer, 0);
            break;
	}
	m_step_cnt++;
}


void control_mode_switch(bool blink)
{
    if(blink){
        switch((uint8_t)mLightManager->light_newmode)
        {
            case UNREACT_MODE_N:
                pwm_disable(&light_pwm[FRONT_LED_PWM]);
                pwm_disable(&light_pwm[REAR_LED_PWM]);
                break;
            
            case REACT_MODE_M:
            case UNREACT_MODE_M:
                pwm_enable(&light_pwm[FRONT_LED_PWM]);
                pwm_disable(&light_pwm[REAR_LED_PWM]);
                HAL_UpdatePwmDuty(PWM_FREQUENCY, 0);
                break;
            
            case REACT_MODE_S:
            case UNREACT_MODE_S:
                pwm_disable(&light_pwm[FRONT_LED_PWM]);
                pwm_enable(&light_pwm[REAR_LED_PWM]);
                HAL_UpdatePwmDuty(0, PWM_FREQUENCY);
                break;
            
            case REACT_MODE_A:        
            case UNREACT_MODE_A:
                pwm_enable(&light_pwm[FRONT_LED_PWM]);
                pwm_enable(&light_pwm[REAR_LED_PWM]);
                HAL_UpdatePwmDuty(PWM_FREQUENCY, PWM_FREQUENCY);
                break;
            
            default:
                break;
        }    
    }else{
        if(mLightManager->light_newmode == mLightManager->light_oldmode && 
           ((mLightManager->light_newmode == UNREACT_MODE_N\
           || mLightManager->light_newmode == UNREACT_MODE_M\
           || mLightManager->light_newmode == UNREACT_MODE_S\
           || mLightManager->light_newmode == UNREACT_MODE_A))){
            return;
        }
        
