GeFengthe/RTL8762/board/evb/fireswitch/app/skylight.c
        switch((uint8_t)mLightManager->light_newmode)
        {
            case REACT_MODE_M:
                pwm_enable(&light_pwm[FRONT_LED_PWM]);
                pwm_disable(&light_pwm[REAR_LED_PWM]);
                for(int i=1;i<=20;i++){
                    HAL_UpdatePwmDuty(PWM_FREQUENCY*i/20, 0);
                    os_delay(2);
                }
                break;
                
            case REACT_MODE_S:
                pwm_enable(&light_pwm[REAR_LED_PWM]);
                pwm_disable(&light_pwm[FRONT_LED_PWM]);
                for(int i=1;i<=20;i++){
                    HAL_UpdatePwmDuty(0, PWM_FREQUENCY*i/20);
                    os_delay(2);
                }
                break;
           
           case REACT_MODE_A:  
                pwm_enable(&light_pwm[FRONT_LED_PWM]);
                pwm_enable(&light_pwm[REAR_LED_PWM]);
                for(int i=1;i<=20;i++){
                    HAL_UpdatePwmDuty(PWM_FREQUENCY*i/20, PWM_FREQUENCY*i/20);
                    os_delay(2);
                }
                break;
        
            case UNREACT_MODE_N:
                if(mLightManager->led_timercnt > 0\
                  || mLightManager->light_oldmode == UNREACT_MODE_M\
                  || mLightManager->light_oldmode == UNREACT_MODE_S\
                  || mLightManager->light_oldmode == UNREACT_MODE_A){
                    if(mLightManager->led_timercnt > 0){
                        m_step_cnt = 0;
                        mLightManager->led_timercnt = 0;
                        mLightManager->led_mode = UNKOWN;
                        Led_Relay_tmr_ctrl_dlps(true);
                        plt_timer_delete(LEDCtrl_timer, 0);
                    }
                    
                    if(mLightManager->light_oldmode == REACT_MODE_M ||
                       mLightManager->light_oldmode == UNREACT_MODE_M)
                    {
                        pwm_enable(&light_pwm[FRONT_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(PWM_FREQUENCY*(20-i)/20, 0);
                            os_delay(2);
                        }
                        pwm_disable(&light_pwm[FRONT_LED_PWM]);
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_S ||
                            mLightManager->light_oldmode == UNREACT_MODE_S)
                    {
                        pwm_enable(&light_pwm[REAR_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(0, PWM_FREQUENCY*(20-i)/20);
                            os_delay(2);
                        }
                        pwm_disable(&light_pwm[REAR_LED_PWM]);
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_A ||
                            mLightManager->light_oldmode == UNREACT_MODE_A)
                    {
                        pwm_enable(&light_pwm[FRONT_LED_PWM]);
                        pwm_enable(&light_pwm[REAR_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(PWM_FREQUENCY*(20-i)/20, PWM_FREQUENCY*(20-i)/20);
                            os_delay(2);
                        }
                        pwm_disable(&light_pwm[FRONT_LED_PWM]);
                        pwm_disable(&light_pwm[REAR_LED_PWM]);
                    }
                }
                break;
            
            
            
            case UNREACT_MODE_M:
                if(mLightManager->led_timercnt > 0\
                  || mLightManager->light_oldmode == UNREACT_MODE_M\
                  || mLightManager->light_oldmode == UNREACT_MODE_S\
                  || mLightManager->light_oldmode == UNREACT_MODE_A){
                    if(mLightManager->led_timercnt > 0){
                        m_step_cnt = 0;
                        mLightManager->led_timercnt = 0;
                        mLightManager->led_mode = UNKOWN;
                        Led_Relay_tmr_ctrl_dlps(true);
                        plt_timer_delete(LEDCtrl_timer, 0);
                    }
                    
                    if(mLightManager->light_oldmode == REACT_MODE_M){
                        return;
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_S ||
                            mLightManager->light_oldmode == UNREACT_MODE_S)
                    {
                        pwm_enable(&light_pwm[FRONT_LED_PWM]);
                        pwm_enable(&light_pwm[REAR_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(PWM_FREQUENCY*i/20, PWM_FREQUENCY*(20-i)/20);
                            os_delay(2);
                        }
                        pwm_disable(&light_pwm[REAR_LED_PWM]);
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_A ||
                            mLightManager->light_oldmode == UNREACT_MODE_A)
                    {
                        pwm_enable(&light_pwm[REAR_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(0, PWM_FREQUENCY*(20-i)/20);
                            os_delay(2);
                        }
                        pwm_disable(&light_pwm[REAR_LED_PWM]);
                    }
                }else{
                    pwm_enable(&light_pwm[FRONT_LED_PWM]);
                    for(int i=1;i<=20;i++){
                        HAL_UpdatePwmDuty(PWM_FREQUENCY*i/20, 0);
                        os_delay(2);
                    }
                }
                break;
            
            
            
            case UNREACT_MODE_S:
               if(mLightManager->led_timercnt > 0\
                  || mLightManager->light_oldmode == UNREACT_MODE_M\
                  || mLightManager->light_oldmode == UNREACT_MODE_S\
                  || mLightManager->light_oldmode == UNREACT_MODE_A){
                    if(mLightManager->led_timercnt > 0){
                        m_step_cnt = 0;
                        mLightManager->led_timercnt = 0;
                        mLightManager->led_mode = UNKOWN;
                        Led_Relay_tmr_ctrl_dlps(true);
                        plt_timer_delete(LEDCtrl_timer, 0);
                    }
                    
