GeFengthe/RTL8762/board/evb/fireswitch/app/skylight.c
                    if(mLightManager->light_oldmode == REACT_MODE_S){
                        return;
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_M ||
                            mLightManager->light_oldmode == UNREACT_MODE_M)
                    {
                        pwm_enable(&light_pwm[FRONT_LED_PWM]);
                        pwm_enable(&light_pwm[REAR_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(PWM_FREQUENCY*(20-i)/20, PWM_FREQUENCY*i/20);
                            os_delay(2);
                        }
                        pwm_disable(&light_pwm[FRONT_LED_PWM]);
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_A ||
                            mLightManager->light_oldmode == UNREACT_MODE_A)
                    {
                        pwm_enable(&light_pwm[FRONT_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(PWM_FREQUENCY*(20-i)/20, 0);
                            os_delay(2);
                        }
                        pwm_disable(&light_pwm[FRONT_LED_PWM]);
                    }
                }else{
                    pwm_enable(&light_pwm[REAR_LED_PWM]);
                    for(int i=1;i<=20;i++){
                        HAL_UpdatePwmDuty(0, PWM_FREQUENCY*i/20);
                        os_delay(2);
                    }
                }
                break;
            
            
            
            case UNREACT_MODE_A:
               if(mLightManager->led_timercnt > 0\
                  || mLightManager->light_oldmode == UNREACT_MODE_M\
                  || mLightManager->light_oldmode == UNREACT_MODE_S\
                  || mLightManager->light_oldmode == UNREACT_MODE_A){
                    if(mLightManager->led_timercnt > 0){
                        m_step_cnt = 0;
                        mLightManager->led_timercnt = 0;
                        mLightManager->led_mode = UNKOWN;
                        Led_Relay_tmr_ctrl_dlps(true);
                        plt_timer_delete(LEDCtrl_timer, 0);
                    }
                    
                    if(mLightManager->light_oldmode == REACT_MODE_A){
                        return;
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_M ||
                            mLightManager->light_oldmode == UNREACT_MODE_M)
                    {
                        pwm_enable(&light_pwm[REAR_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(0, PWM_FREQUENCY*i/20);
                            os_delay(2);
                        }
                    }
                    else if(mLightManager->light_oldmode == REACT_MODE_S ||
                            mLightManager->light_oldmode == UNREACT_MODE_S)
                    {
                        pwm_enable(&light_pwm[FRONT_LED_PWM]);
                        for(int i=1;i<=20;i++){
                            HAL_UpdatePwmDuty(PWM_FREQUENCY*i/20, 0);
                            os_delay(2);
                        }
                    }
                }else{
                    pwm_enable(&light_pwm[FRONT_LED_PWM]);
                    pwm_enable(&light_pwm[REAR_LED_PWM]);
                    for(int i=1;i<=20;i++){
                        HAL_UpdatePwmDuty(PWM_FREQUENCY*i/20, PWM_FREQUENCY*i/20);
                        os_delay(2);
                    }
                }
                break;
            
            default:
                break;
        }    
        
    }
    APP_DBG_PRINTF("TIM_GetPWMOutputStatus:%d, %d", TIM_GetPWMOutputStatus(TIM2), TIM_GetPWMOutputStatus(TIM3));// 读取当前定时器的PWM电平（高低）
}


static void enable_pwm(void)
{
    switch((uint8_t)mLightManager->light_newmode)
    {
        case UNREACT_MODE_N:
            pwm_disable(&light_pwm[FRONT_LED_PWM]);
            pwm_disable(&light_pwm[REAR_LED_PWM]);
            break;
        
        case REACT_MODE_M:
        case UNREACT_MODE_M:
            pwm_enable(&light_pwm[FRONT_LED_PWM]);
            pwm_disable(&light_pwm[REAR_LED_PWM]);
            break;
        
        case REACT_MODE_S:
        case UNREACT_MODE_S:
            pwm_disable(&light_pwm[FRONT_LED_PWM]);
            pwm_enable(&light_pwm[REAR_LED_PWM]);
            break;
        
        case REACT_MODE_A:        
        case UNREACT_MODE_A:
            pwm_enable(&light_pwm[FRONT_LED_PWM]);
            pwm_enable(&light_pwm[REAR_LED_PWM]);
            break;
        
        default:
            break;
    }  
    
    if(mLightManager->led_mode == FAST_BLINK ||
       mLightManager->led_mode == SLOW_BLINK){
        pwm_enable(&light_pwm[REAR_LED_PWM]);
    }
}


void Start_LED_Timer(void)
{
    enable_pwm();
	if(LEDCtrl_timer == NULL){
		LEDCtrl_timer = plt_timer_create("led", 20, true, 0, SkyLed_Timeout_cb); 
		if(LEDCtrl_timer != NULL){
//			APP_DBG_PRINTF("singal led mode:%d\r\n", mLightManager->led_mode);
			Led_Relay_tmr_ctrl_dlps(false);
			plt_timer_start(LEDCtrl_timer, 0);
		}
	}else{
        m_step_cnt = 0;
    }
}


void Delete_LED_Timer(void)
{
    plt_timer_delete(LEDCtrl_timer, 0);
    Led_Relay_tmr_ctrl_dlps(true);
}


#endif
